{
    "take": [
        "Rule 1: For action 'take', if the 'item_in_hand' is not empty, the action will fail; Checking Method: Verify if 'item_in_hand' contains any item.",
        "Rule 2: For action 'take', if the 'current_position' does not match the 'source' location of the object to be taken, the action will fail; Checking Method: Check if 'current_position.location_name' is equal to 'action.args.source'."
    ],
    "go to": [
        "Rule 1: For action 'go to', if the 'target' location is not in the 'reachable_locations', the action will fail; Checking Method: Check if the 'target' location specified in the action's arguments is present in the 'reachable_locations' list of the initial state. If not present, the action will fail.",
        "Rule 2: For action 'go to', if the 'current_position' location is already the 'target' location and the 'status' is 'null', the action will fail; Checking Method: Check if the 'current_position' location_name matches the 'target' location specified in the action's arguments and the 'status' is 'null'. If both conditions are met, the action will fail."
    ],
    "open": [
        "Rule 1: For action 'open', if the 'target' is in the 'reachable_locations' but the 'current_position' is not adjacent to the 'target', the action will fail; Checking Method: Check if the 'target' location specified in the action is present in the 'reachable_locations' list of the initial state and whether the 'current_position' is adjacent to the 'target'.",
        "Rule 2: For action 'open', if the 'item_in_hand' is not empty, the action will fail; Checking Method: Check if the 'item_name' in 'item_in_hand' is not None in the initial state."
    ],
    "heat": [
        "Rule 2: For action 'heat', if the current position of the tool specified in 'action.args.tool' is not 'closed', the action will fail; Checking Method: Check if 'current_position.status' for the location specified in 'action.args.tool' is 'open'.",
        "Rule 1: For action 'heat', if the object to be heated is not located inside the heating tool (e.g., a microwave), the action will fail; Checking Method: Check if the object is not listed under 'items_in_locations' for the current location of the tool specified in 'action.args.tool'."
    ],
    "put": [
        "Rule 1: For action 'put', if the target location is already full or cannot accommodate the object, the action will fail; Checking Method: Check if the 'items_in_locations' list for the 'target' location is at capacity or if the target location inherently cannot hold the type of object being placed.",
        "Rule 2: For action 'put', if the object is not currently in hand, the action will fail; Checking Method: Check if 'item_in_hand' is None or does not match the 'obj' in the action's arguments.",
        "Rule 4: For action 'put', if the object is specified to be placed in/on another object that is not present at the target location, the action will fail; Checking Method: Verify if the specified object (e.g., 'in/on pot 2') exists in the 'items_in_locations' of the 'target'.",
        "Rule 3: For action 'put', if the current position status is incompatible with accessing the target location (e.g., a closed fridge or different room), the action will fail; Checking Method: Check the 'current_position' status and ensure it allows interaction with the 'target' location and that the 'target' is in the same room or accessible from the current location.",
        "Rule 5: For action 'put', if the target location is not accessible due to physical barriers or restrictions from the current position, the action will fail; Checking Method: Ensure there are no barriers or restrictions that prevent reaching the 'target' from the 'current_position'."
    ],
    "clean": [
        "Rule 1: For action 'clean', if the tool used is not in the same location as the object being cleaned, the action will fail; Checking Method: Verify if the location of the tool is different from the location of the object in hand specified in 'item_in_hand'. If they are different, the rule applies and the action will fail.",
        "Rule 2: For action 'clean', if the tool used is not suitable for cleaning the object in hand or is not present at the object's location, the action will fail; Checking Method: Check if the tool specified in the action's 'args' is not a commonly recognized cleaning tool (e.g., dish sponge, cloth) for the object type in 'item_in_hand', or if the tool is not present in the same location as the object in hand. If either condition is true, the rule applies and the action will fail."
    ]
}
